// *************************************
// 版权所有：广州亚思信息科技有限公司
// 文件名：colourcode.cpp
// 作者：陆巍
// 版本：1.0
// 日期：2016年9月
// 描述: 色标实现文件
// *************************************

#include "stdafx.h"
#include "colourcode.h"

// 基准色标

const COLORREF kColor[] = {
	RGB(0, 0, 0),         // 0 纯黑色
	RGB(255, 255, 255),   // 1 纯白色
	RGB(102, 102, 102),   // 2 状态栏背景色
	RGB(248,252,248),   // 3
// 	RGB(94, 85, 93),      // 4
	RGB(128, 0, 128),      // 4
	RGB(216, 64, 145),    // 5
	// 	RGB(107, 37, 137),    // 6
	RGB(0, 0, 0),    // 6
	// 	RGB(9, 4, 117),       // 7
	RGB(0, 0, 255),       // 7
	RGB(220, 220, 220),   // 8 标准背景色
	// 	RGB(0, 154, 83),      // 9
	RGB(0, 255, 0),      // 9
	RGB(94, 151, 24),     // 10 标准绿
	RGB(0, 0, 255),       // 11 纯蓝
	RGB(211, 37, 37),     // 12
};